<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@ taglib prefix="cf" uri="/WEB-INF/CardFantasyTags.tld" %>
    <div id="news" class="main-page" data-role="page" data-category="main-page" data-title="魔卡幻想模拟器" data-mini="true" data-theme="${theme}">
        <div class="dashboard" data-role="content">
            <div>
                <a href="#news-left-panel" data-role="button" data-mini="true" data-theme="b">点击左上角导航按钮开始使用模拟器</a>
            </div>
            <div data-role="collapsible" data-collapsed="false" data-mini="true">
                <h3>公告</h3>
                <ul>
                    <li><a href="#" data-type="bug">魔卡幻想模拟器贴吧</a>已成立，欢迎大家来提BUG、提需求、提供技能结算细节。</li>
                    <li>最近工作生活实在太忙，已经快抽不出时间做模拟器了，若有精英愿加入开发阵营，感激不尽！有意者戳<a href="#open-source">这里</a>。</li>
                    <li style="color: red">日前发现有人利用外挂或辅助连接模拟器进行海量计算，导致模拟器服务器瘫痪。请立即停止这种行为！目前仅仅是封IP，不想就为了这件事加入验证码，搞得大家都不方便。</li>
                    <li style="color: red">群里小伙伴做的魔卡全方面的wiki很全而且更新很快，有需要的可以访问<a href="http://mkhx.humphreyj.com/">魔卡百科</a></li>
                    <!-- <li><a href="<c:url value="/Wiki/index.shtml" />" target="_blank">魔卡幻想WIKI</a>子站点正式成立，作为新的尝试，欢迎大家来<a href="#" data-type="bug">贴吧</a>提需求和报告BUG。</li>-->
                    <!-- <li>三区（前五区）大神【砍掉重练】已经把他的模拟器和这个模拟器合并了，以后都会共同开发，最近的新卡几乎都是他做的。</li>-->
                    <!-- <li>现在模拟器能识别卡牌昵称或简称了，直接手动输入卡组变得更容易了。当然肯定有漏掉的，欢迎大家来<a href="#" data-type="bug">贴吧</a>补充。</li> -->
                    <!-- <li>小提示：如果想保存卡组，只要把卡组的文字表述记下来存在文本文件或者手机备忘录里，下次要用的时候复制回来就行。</li> -->
                    <!-- <li>小提示：可以灵活使用*0的表达法来方便配卡哦。</li> -->
                </ul>
            </div>
            <%--
            <div data-role="collapsible" data-collapsed="false" data-mini="true" data-content-theme="d">
                <h3>技能细节问答，欢迎大家来补完技能细节，使模拟器更准确</h3>
                <ul>
                    <c:forEach items="${questions}" var="question">
                    <li>
                        <span>【<a href="http://tieba.baidu.com/p/<c:out value="${question.tiebaId}" />" target="_blank">我去回答</a>】</span>
                        <c:out value="${question.title}" />
                    </li>
                    </c:forEach>
                    <li><a href="#" data-type="bug">更多问题...</a></li>`
                </ul>
            </div>
            --%>
            <div data-role="collapsible" data-collapsed="false" data-mini="true">
                <h3>更新日志</h3>
                <ul class="news-content">
                    <li>2017-12-20: <x>欢笑，波波</x><ul>
                        <li>修复技能【新卡制成】【突突突】对魔神生效的bug</li>
                        <li>修改技能【司命】可以发动降临技能</li>
                        <li>添加卡牌【祭血先锋】,【终焉守护】,【高维进化者】</li>
                        <li>更新模拟器卡图</li>
                        <li>更新wiki</li>
                        <li>更新22图过关条件</li>
                    </ul></li>
                    <li>2017-12-13: <x>欢笑，波波</x><ul>
                        <li>修复技能【新生】不发动死契的bug，修复【新生】导致召唤物死亡后进入卡组bug</li>
                        <li>修复技能【司命】红字问题</li>
                        <li>修复国家（魏蜀吴）buff不能生效的bug</li>
                        <li>修改符文【背水】为空场不发动</li>
                        <li>修改技能【双斩】可以添加等级</li>
                        <li>更新地图22图符文数据</li>
                        <li>添加技能【魔龙之怒】,【降临星河召唤】，【森之星河】</li>
                        <li>添加技能【遗志归魂】,【遗志镜像】</li>
                        <li>更新卡牌【圣诞·孟起】,【圣诞剑灵使】,【圣诞王女】</li>
                        <li>n区的圣诞卡牌数据提供后添加。</li>
                    </ul></li>
                    <li>2017-12-08: <x>欢笑，波波</x><ul>
                        <li>修复技能【司命】BUG，添加死契【灵魂消散】</li>
                        <li>修改添加技能类机制，修复添加技能卡牌死亡后技能不移除的BUG</li>
                        <li>修复铁壁等级错位的BUG</li>
                        <li>修复【一文字】可能攻击死亡卡牌的bug</li>
                        <li>修复【召唤物】转生红字问题</li>
                        <li>添加卡牌【炙火酋长】，【三国英魂子桓】，【三国英魂公嗣】，【三国英魂伯符】，【三国英魂星彩】，【巨大毒汁怪】，【电波教师】</li>
                        <li>更新英雄血量到140级</li>
                        <li>添加技能【影青龙】等(22图技能已经更新不在赘述)</li>
                        <li>更新符文逆流</li>
                        <li>更新地图22图</li>
                    </ul></li>
                    <li>2017-11-11: <x>欢笑，清风，波波</x><ul>
                        <li>修复卡牌【魔卡策划】bug，修复【孟德】可能出现的无限复制bug</li>
                        <li>修复被复活的卡牌不能发动降临技能的bug</li>
                        <li>调整【剑域】等技能的发动时机为回合开始时</li>
                        <li>调整召唤的卡牌限定技能只能发动一次</li>
                        <li>添加卡牌【鬼魅小丑】，【化学委员】，【雪峰飞狐】，【南华仙女】，【九尾妖狐】，【紫虚仙子】，【魔导剑巫】</li>
                        <li>觉醒卡牌【星夜女神】，【残翼女神】，【无限之神】</li>
                        <li>更新地下城到90层</li>
                        <li>更新噩梦地图的条件，现在噩梦地图条件不需要手动输入</li>
                        <li>更新友情链接</li>
                    </ul></li>
                    <li>2017-11-04: <x>欢笑，清风，波波</x><ul>
                        <li>修复斩羽【一文字】不能攻击自己以及【逃跑】【送还】【地裂】时buff不移除，</li>
                        <li>修改给手牌添加类技能机制，只能添加一个技能</li>
                        <li>修改鬼半藏等待为1</li>
                        <li>觉醒圆月魔女</li>
                        <li>更新模拟器卡图</li>
                    </ul></li>
                    <li>2017-10-30: <x>欢笑，清风，波波</x><ul>
                        <li>修复横扫类技能叠加冲突的BUG，修复技能【决胜时刻】BUG</li>
                    </ul></li>
                    <li>2017-10-29: <x>欢笑，清风，波波</x><ul>
                        <li>修复都市丽人先机镜像BUG</li>
                        <li>添加卡牌【冰雪女王】，【莹丸香子兰】，【斩羽斑鸠】，【钻石王牌】，【酒馆老板】，【封印守望者】，【魔卡策划】，【松鼠精灵】，【暗影龙母】，【鬼半藏】</li>
                        <li>添加符文【明镜】</li>
                    </ul></li>
                    <li>2017-10-08: <x>欢笑，清风，波波</x><ul>
                        <li>修复逃跑铁壁，镜面不能正常移除的bug，感谢<x>灬淡蓝色de雪</x>的帮助</li>
                        <li>修改回魂，地裂机制</li>
                        <li>修改降临的二段技能（复活，献祭，时光倒流）的机制</li>
                        <li>修改嘲讽技能对连击不生效</li>
                        <li>添加卡牌【圣域裁决者】，【圣德修女】，【愈音憩梦】，【森林仙子】，【纯白刀华】，【机车少女】，【四神之玄武】，【镰舞姬夜】</li>
                        <li>添加技能【雀之引】，【碎裂怒吼】</li>
                        <li>觉醒卡牌【银河观测者】</li>
                        <li>修复雷系法术可以被魔甲抵挡</li>
                    </ul></li>
                    <li>2017-09-14: <x>欢笑，清风，波波</x><ul>
                        <li>修复文若遇到时间溯行铁壁，镜面不能正常移除的bug</li>
                    </ul></li>
                    <li>2017-09-11: <x>欢笑，清风，波波</x><ul>
                        <li>修复觉醒技能在需要多张卡牌时触发异常的BUG</li>
                    </ul></li>
                    <li>2017-09-05: <x>欢笑，清风，波波</x><ul>
                        <li>O_O久违的更新</li>
                        <li>添加卡牌【萌喵少女】，【死亡微笑】，【地狱雷龙】，【腥红罪枪】，【眠梦公主】，【三国英魂·文若】，【三国英魂·子义】，【缚魂者】</li>
                        <li>修改卡牌【灿日娇阳】技能【海滨危机】</li>
                        <li>修复【袈裟斩】燕返可以在不屈状态下触发。</li>
                    </ul></li>
                    <li>2017-08-22: <x>欢笑，清风，波波</x><ul>
                        <li>添加技能【灵龙轰咆】，【死契时光倒流】</li>
                        <li>将噩梦地图的加成和地下城加成标识</li>
                        <li>噩梦地图的过关条件暂未添加，需要自己添加</li>
                    </ul></li>
                    <li>2017-08-14: <x>欢笑，清风，波波</x><ul>
                        <li>修复技能【常夏日光】，【太平要术】</li>
                        <li>添加【寒莹触碰】50%冰冻效果</li>
                        <li>修改技能【复活】可以复活1星卡牌</li>
                    </ul></li>
                    <li>2017-08-12: <x>欢笑，清风，波波</x><ul>
                        <li>更新131级到135级英雄血量和英雄cost</li>
                        <li>修复【反击屏障】血量不足时，反击伤害结算错误的BUG</li>
                        <li>调整【嘲讽】不能嘲讽横扫攻击</li>
                        <li>添加卡牌【喜雨少女】,【祈愿少女】，【夜魅菡萏】，【寒莹原素】，【薜荔原素】，【原素曜灵】，【三国英魂张角】，【拂夏清风】，【强袭少女】，【晴空夏影】，【波涛海韵】，【灿日娇阳】，【绯炎少校】</li>
                        <li>觉醒卡牌【命运占卜师】，【巨岛龟幼崽】</li>
                    </ul></li>
                    <li>2017-08-07: <x>欢笑，清风，波波</x><ul>
                        <li>修复地下城模块地图卡牌血量加成错误的BUG</li>
                    </ul></li>
                    <li>2017-08-06: <x>欢笑，清风，波波</x><ul>
                        <li>修复新生技能有可能不发动BUG</li>
                        <li>调整100-110层地下城的加成</li>
                        <li>修改冰原领主15级cost</li>
                    </ul></li>
                    <li>2017-08-05: <x>欢笑，清风，波波</x><ul>
                        <li>修复孟德，伯言，猫神，黑羽可以被夺魂的bug，感谢<x>心坚手残信仰白</x>的帮助。</li>
                    </ul></li>
                    <li>2017-08-03: <x>欢笑，清风，波波</x><ul>
                        <li>添加地下城模块，地下城模块可以模拟100层以后（包括100层）地下城关卡和噩梦地图，地下城和噩梦地图的过关条件需要自己添加，后续会更新噩梦地图的过关条件。</li>
                    </ul></li>
                    <li>2017-07-24: <x>欢笑，清风，波波，林知兀，布萨龙等</x><ul>
                        <li>更新卡牌【萌喵女仆】</li>
                        <li>修复【不屈】技能在【炼金失败时】不发动BUG</li>
                        <li>修复【归魂】手牌满时墓地卡牌消失BUG</li>
                    </ul></li>
                    <li>2017-07-18: <x>欢笑，清风，波波，林知兀，布萨龙等</x><ul>
                        <li>感谢波波和清风整理的噩梦地图阵容，<a href="<c:url value="/resources/download/噩梦地图阵容信息.txt" />" download="噩梦地图阵容信息" target="_blank">下载噩梦地图</a></li>
                    </ul></li>
                    <li>2017-07-17: <x>欢笑，清风，波波，林知兀，布萨龙等</x><ul>
                        <li>更新卡牌【悠风奏者】,【三国英魂·玄德】</li>
                        <li>修复【玫瑰甜心】二维错误,感谢<x>静默灬低吟</x>提供帮助</li>
                    </ul></li>
                    <li>2017-07-06: <x>欢笑，清风，波波，林知兀，布萨龙等</x><ul>
                        <li>修复技能【过载】文字显示BUG</li>
                        <li>修复技能【巅峰军曹】召唤技能没有分开的BUG</li>
                        <li>修复【美味厨娘】的【生命符文】技能未添加的BUG</li>
                        <li>修复【血色玫瑰】可被【夺魂】BUG</li>
                        <li>修复【九命猫神】【镜像】重复发动的BUG</li>
                    </ul></li>
                    <li>2017-07-04: <x>欢笑，清风，波波，林知兀，布萨龙等</x><ul>
                        <li>添加符文【背水】</li>
                        <li>觉醒卡牌【九命猫神】</li>
                        <li>添加卡牌【冰原领主】</li>
                        <li>修复类似【剑舞】类别附加技能死亡时无法移除的问题</li>
                    </ul></li>
                    <li>2017-06-28: <x>欢笑，清风，波波，林知兀，布萨龙等</x><ul>
                        <li>添加技能【降临封印】</li>
                        <li>去除【灵龙轰咆】中的远古元素巨龙</li>
                    </ul></li>
                    <li>2017-06-26: <x>欢笑，清风，波波，林知兀等</x><ul>
                        <li>修复技能【魔力法阵】结算魔法伤害是分段结算导致【魔甲】等技能伤害结算不正确</li>
                        <li>修复技能【祈愿】可以发动一次攻击的先机技能</li>
                    </ul></li>
                    <li>2017-06-24: <x>欢笑，清风，波波，林知兀等</x><ul>
                        <li>修复技能【坚壁】，【剑域】，【生命符文】BUG</li>
                        <li>修复【血色玫瑰】死契召唤的【玫瑰甜心】无限制镜像BUG</li>
                    </ul></li>
                    <li>2017-06-22: <x>欢笑，清风，波波，林知兀等</x><ul>
                        <li>修复【铁壁】叠加错误的BUG，修复【剑域】不能叠加的BUG</li>
                        <li>修复【魔力法阵】不能给与魔神debuff的BUG</li>
                        <li>添加技能降临【魔力法阵】</li>
                        <li>添加卡牌【都市丽人】</li>
                        <li>修复卡牌【炮灰】等待时间</li>
                    </ul></li>
                    <li>2017-06-20: <x>欢笑，清风，波波，林知兀等</x><ul>
                        <li>修复【夺魂】不能被复活的BUG</li>
                        <li>修复【鬼才】可以被夺魂的BUG，感谢欧细诺奇的帮助</li>
                        <li>修复【魔力法阵】加成错误</li>
                    </ul></li>
                    <li>2017-06-19: <x>欢笑，清风，波波，林知兀等</x><ul>
                        <li>修复【雷霆一击】不能被魔甲结算的BUG</li>
                        <li>修复【连斩】技能为普通攻击</li>
                        <li>修复【生命符文】，【战歌之鼓】不能叠加的BUG</li>
                        <li>更新卡牌【三国英魂·仲颖】，【忧郁爱之公主】，【巅峰军曹】，【巅峰伍长】，【巅峰兵长】</li>
                        <li>更新卡牌【三国英魂·伯言】，【三国英魂·子敬】，【炮灰】</li>
                        <li>添加技能【剑域】，感谢EEE的帮助</li>
                    </ul></li>
                    <li>2017-06-12: <x>欢笑，清风，波波等</x><ul>
                        <li>更新困难莉莉丝技能</li>
                        <li>修复鬼才侵蚀对魔神生效的BUG</li>
                        <li>修复【雷霆一击】可以被法反技能格挡的BUG</li>
                        <li>修复【玫瑰甜心】二维</li>
                    </ul></li>
                    <li>2017-06-11: <x>欢笑，清风，波波等</x><ul>
                        <li>修复【神魔之甲】可以被灵王的轰击造成3倍伤害，感谢<x>梦想i号</x>提供帮助</li>
                        <li>添加技能【化学风暴】【月之守望】</li>
                        <li>添加卡牌【电脑怪杰】，【极道拳师】，【科技忍者】，【西部火枪手】</li>
                        <li>添加新的莉莉丝</li>
                    </ul></li>
                    <li>2017-06-07: <x>欢笑，清风，波波等</x><ul>
                        <li>修复【夺魂】可以夺取拥有【逃跑】技能的卡牌的BUG</li>
                        <li>修复【终焉使者】魔族之血重复发动的BUG </li>
                        <li>修复【觉醒天崩地裂】不动卡牌只统计敌方场上不动卡牌的BUG</li>
                        <li>修复【雷霆一击】与魔甲的结算BUG，现在可以被魔甲减伤</li>
                        <li>修复【神兵召唤】在迷魂状态下发动的BUG</li>
                        <li>修复【时光倒流】在魔族卡牌处于手牌对其生效的BUG</li>
                        <li>修改【舌战群儒】不需要添加降临也可以发动</li>
                        <li>修复【无刀取】控制状态下不发动BUG</li>
                        <li>添加【狂暴】技能</li>
                        <li>觉醒卡牌【红莲魔女】</li>
                    </ul></li>
                    <li>2017-06-06: <x>欢笑，清风，波波等</x><ul>
                        <li>修复【三国英魂·云长】打脸触发BUG</li>
                        <li>修复【暗黑游侠】上层精灵挽歌回魂不是降临技能 </li>
                        <li>修复【暗黑游侠】上层精灵挽歌燕反和【四神之朱雀】圣炎冲突导致的BUG</li>
                    </ul></li>
                    <li>2017-06-04: <x>欢笑，清风，波波等</x><ul>
                        <li>更新模拟器动画战斗小头像</li>
                        <li>修复【剑舞】可以给后置卡牌添加技能的BUG</li>
                        <li>修复【灵王的轰击】类技能可以正确结算（3倍）被沉默的免疫卡</li>
                        <li>修复【结界立场】可以正确被【灵王的轰击】类技能结算 </li>
                    </ul></li>
                    <li>2017-05-30: <x>欢笑，清风，波波等</x><ul>
                        <li>修复【觉醒天崩地裂】，【地裂】BUG</li>
                        <li>修复【镜魔】的技能</li>
                    </ul></li>
                    <li>2017-05-22: <x>欢笑，清风，波波等</x><ul>
                        <li>修复【铁壁】英雄不死亡BUG,感谢Bsctk1提供【铁壁】BUG</li>
                        <li>修复【血色玫瑰】不召唤【玫瑰甜心】BUG,感谢MKAlieZz提供【血色玫瑰】BUG</li>
                        <li>在wiki中添加【魔族】,感谢paraych建议</li>
                    </ul></li>
                    <li>2017-05-21: <x>欢笑，清风，波波等</x><ul>
                        <li>添加新卡【血色玫瑰】，【律政佳人】</li>
                        <li>添加第四技能【六道轮回】</li>
                        <li>修复【连斩】只触发一次BUG,修复【生命符文】死亡后移除的BUG,修复【魔龙之血】可以被沉默BUG,修复【魔族】可以被时间溯行和时光倒流的BUG</li>
                    </ul></li>
                    <li>2017-05-17: <x>欢笑，清风，波波等</x><ul>
                        <li>添加新卡【美味厨娘】</li>
                        <li>添加新技能【圣母吟咏】，【地裂】，【爱心料理】</li>
                        <li>修复【逃跑】不能被【复活】的BUG，修复魔族【圣炎】BUG，修复【沉默】导致的遗志BUG和【复活】BUG</li>
                    </ul></li>
                    <li>2017-05-15: <x>欢笑，清风，波波等</x><ul>
                        <li>添加新卡【三国英魂·甄姬】</li>
                        <li>添加新技能【洛神】</li>
                        <li>更新wiki</li>
                    </ul></li>
                    <li>2017-05-12: <x>欢笑，清风，波波等</x><ul>
                        <li>添加新卡【三国英魂·云长】【三国英魂·汉升】【四神之朱雀】【终焉使者】</li>
                        <li>觉醒卡牌【欲望惩罚者】</li>
                        <li>添加新技能【连斩】，【武圣】，【穿云箭】，【百步穿杨】，【坚毅】，【精准射击】，【凤凰涅磐】，【业火】，【觉醒：天崩地裂】，【魔族之血】，【魔龙吐息】，【村正】，【圣母咏叹调】，【神兵降临】</li>
                        <li>修复了【LET IT GO】技能会主动送还不动的BUG,修改森之小魔女技能</li>
                        <li>更新wiki</li>
                    </ul></li>
                    <li>2017-05-07: <x>欢笑，清风，波波等</x><ul>
                        <li>添加新卡【三国英魂·孟起】【武形银枪尊者】【剃刀之尾】</li>
                        <li>觉醒卡牌【爱神】</li>
                        <li>添加新技能【西凉铁骑】，【袈裟斩】，【武形秘法】，【致命打击】，【战歌之鼓】</li>
                        <li>修复了【LET IT GO】技能能主动送还免疫卡的BUG、【无刀取】技能会不断叠加圣盾导致出错的BUG</li>
                    </ul></li>
                    <li>2017-04-28: <x>欢笑，清风，波波等</x><ul>
                        <li>添加新卡【三国英魂·元让】【暗月魅影】</li>
                        <li>添加新技能【刚烈】，【寒冰之盾】</li>
                        <li>修复了【万兽之王】BUG，修复防御技能BUG</li>
                    </ul></li>
                    <li>2017-04-26: <x>欢笑，清风，波波等</x><ul>
                        <li>添加新卡【春樱斗魂】【三国樱魂·文远】【四神之青龙】【迷糊女仆】【夜下狂花】【森之小魔女】</li>
                        <li>觉醒卡牌【亡灵守护神】</li>
                        <li>添加新技能【突袭】，【逆鳞】，【雷霆之怒】，【樱魂】，【破军】，【结界立场】，【精神污染】</li>
                        <li>修复了【根源之力】技能未实装的BUG</li>
                        <li>更改了【骑士守护】【骑士荣耀】【骑士信仰】技能的机制，使其在卡牌血量不足时能正常受到法术伤害</li>
                    </ul></li>
                    <li>2017-04-18: <x>欢笑，清风，波波等</x><ul>
                        <li>修复镜魔bug,更新卡牌苍穹碧骑，结界稻草人，花舞剑士，玫瑰甜心，三国英魂·华佗，爱之使者，万兽之王，夜樱少女，末日系列卡</li>
                        <li>截至目前为止，青龙，梦起，春樱斗魂，迷糊女仆，武形银枪尊者，以及魔神卡没有更新，其他更新完毕。</li>
                    </ul></li>
                    <li>2017-04-01: 添加了一堆卡牌功能，具体更新日志留待<x>清风</x>和<x>欢笑</x>下次添加</li>
                    <li>2017-03-09: <x>绯弹亚丝娜</x><ul>
                        <li>更新了21图地图数据和模拟器选项</li>
                        <li>更新了所有新卡数据</li>
                        <li>添加了新技能【无尽梦魇】，【百鬼夜行】，【武形降临】，【无尽华尔兹】，【侵蚀】，【全领域沉默】，【双斩】，【涅槃】等</li>
                        <li>需要注意的是，为了方便大家模拟21图，很多新技能都是作为白板技能添加进来的，所以很多新卡都是大白板，没有技能。</li>
                    </ul></li>
                    <li>2016-12-30: (本次代码由<x>绯弹亚丝娜</x>提供)<ul>
                        <li>添加新卡<cf:c>三国英魂·曹操</cf:c><cf:c>红丝绒公主</cf:c></li>
                        <li>添加新技能【虚梦】</li>
                        <li>修复了黑鸦收魂者召唤的镜像不能被连锁攻击的bug</li>
                        <li>更新了进化的卡牌<cf:c>雪月花</cf:c></li>
                    </ul></li>
                    <li>2016-12-29: (本次代码由<x>绯弹亚丝娜</x>提供)<ul>
                        <li>感谢<x>银色孤星</x>, <x>huangzhe8263</x>, <x>Core灬酷睿</x>, <x>846533685</x>和<x>左牵黄x右擎苍</x>的帮助</li>
                        <li>添加新卡<cf:c>森之斗者</cf:c><cf:c>三国英魂·奉先</cf:c><cf:c>三国英魂·貂蝉</cf:c></li>
                        <li>添加新技能【无双】，【离间】，【闭月】，【镜面】</li>
                        <li>更改了时间溯行（夺魂）的机制，使其不能对免疫不动（守护）单位生效</li>
                        <li>修复了过载技能只能增加一半攻击力的bug</li>
                        <li>修复了时间溯行可以送还魔神的bug</li>
                        <li>修复了夺魂技能导致胜利条件判断出现问题的bug</li>
                    </ul></li>
                    <li>2016-12-20: (本次代码由<x>绯弹亚丝娜</x>提供)<ul>
                        <li>更新游戏数据到2.0</li>
                        <li>添加新卡<cf:c>时之炼金士</cf:c><cf:c>灵龙守护者</cf:c><cf:c>三国英魂·大乔</cf:c><cf:c>花丛迷子</cf:c></li>
                        <li>添加新卡<cf:c>懒洋洋仙人掌</cf:c><cf:c>气冲冲仙人掌</cf:c><cf:c>针刺刺仙人掌</cf:c></li>
                        <li>添加所有试炼魔神卡牌</li>
                        <li>添加新技能【时间溯行】，【灵龙轰咆】，【神之守护】，【国色】，【凋零陷阱】，【群体追击】</li>
                        <li>修改魔神模拟次数计算机制</li>
                        <li>修复了战争咆哮只能对最多10个单位起效的bug</li>
                    </ul></li>
                    <li>2016-12-19: 添加新卡<cf:c>迷途喵娘</cf:c></li>
                    <li>2016-11-30: <ul>
                        <li>添加新技能【王之守护】</li>
                        <li>调整五星小兵阵容, 感谢<x>zoujiankun2001</x>和<x>会飞的霍比特人</x>的帮助</li>
                    </ul></li>
                    <li>2016-11-24: 添加新卡<cf:c>三国英魂·翼德</cf:c></li>
                    <li>2016-11-19: 修复<cf:c>黑鸦收魂者</cf:c>召唤出的镜像的技能BUG</li>
                    <li>2016-11-18: <ul>
                        <li>修复【魔神之刃】的数值BUG, 感谢<x>千下</x>和<x>银色孤星</x>的帮助</li>
                        <li>修复<cf:c>三国英魂·子龙</cf:c>的技能错误, 感谢<x>千下</x>, <x>xiajianke1983</x>和<x>year皮蛋瓜瓜</x>的帮助</li>
                    </ul></li>
                    <li>2016-11-17: <ul>
                        <li>修复<cf:c>英灵守卫者</cf:c>召唤的卡牌, 感谢<x>裂空座2012</x>, <x>绯弹亚丝娜</x>和<x>银色孤星</x>的帮助</li>
                        <li>修复普通召唤技能的BUG, 感谢<x>0728zhJ</x>的帮助</li>
                        <li>添加新技能【过载】, 【会心一击】, 【三千世界】, 【无我境界】, 【神魔之甲】</li>
                        <li>添加新卡<cf:c>三国英魂·子龙</cf:c></li>
                        <li>修复魔神战有时候会出现'Invalid guard name'的错误, 感谢<x>zoujiankun2001</x>和<x>银色孤星</x>的帮助</li>
                    </ul></li>
                    <li>2016-11-13: <ul>
                        <li>更新召唤的机制, 感谢<x>Core灬酷睿</x>和<x>donysea</x>的帮助</li>
                        <li>更新<cf:c>死域军神</cf:c>的技能, 感谢<x>飞帆过的个</x>的帮助</li>
                        <li>添加新卡<cf:c>英灵守护者</cf:c>和<cf:c>星之守护者</cf:c>, 感谢<x>Core灬酷睿</x>的帮助</li>
                        <li>修复【灵魂消散】会对魔神召唤物起效的BUG</li>
                        <li>添加新卡<cf:c>黑鸦收魂者</cf:c></li>
                    </ul></li>
                    <li>2016-10-27: <ul>
                        <li>添加新卡<cf:c>武形破拳尊者</cf:c>, 感谢<x>Core灬酷睿</x>的帮助</li>
                        <li>更新魔神战五星小兵的种类, 感谢<x>Core灬酷睿</x>和<x>会飞的霍比特人</x>的帮助</li>
                    </ul></li>
                    <li>2016-10-17: <ul>
                        <li>添加新卡<cf:c>梦魇猎手·岚</cf:c>, <cf:c>梦魇猎手·霜</cf:c>, <cf:c>梦魇猎手·胧</cf:c></li>
                        <li>添加新卡<cf:c>魂灵利刃</cf:c>, <cf:c>魂灵猎鹰</cf:c>, <cf:c>魂灵疾风</cf:c></li>
                    </ul></li>
                    <li>2016-10-3: 添加新技能【冰神附体】, 感谢<x>Core灬酷睿</x>的帮助</li>
                    <li>2016-10-1: <ul>
                        <li>修复【沉默】和魔神魔王作用时的几个BUG, 感谢<x>欺一世时光_</x>的帮助</li>
                        <li>添加<cf:c>网页版武形火焰尊者</cf:c>, 感谢<x>yyt112233</x>的帮助</li>
                        <li>添加新卡<cf:c>大江三鬼·金</cf:c>和<cf:c>大江三鬼·银</cf:c></li>
                    </ul></li>
                    <li>2016-9-24: <ul>
                        <li>添加新卡<cf:c>水晶巨龙</cf:c>, 感谢<x>会飞的霍比特人</x>的帮助, 感谢<x>砍掉重练</x>大神的代码</li>
                        <li>添加新卡<cf:c>大江三鬼·红</cf:c>, 感谢<x>会飞的霍比特人</x>的帮助</li>
                        <li>添加新卡<cf:c>武形神射尊者</cf:c></li>
                        <li>添加新卡<cf:c>地魔龙</cf:c></li>
                        <li>添加新卡<cf:c>精灵游骑兵</cf:c></li>
                        <li>添加新卡<cf:c>山地兽</cf:c></li>
                        <li>添加【月之守护】等一系列新技能</li>
                    </ul></li>
                    <li>2016-9-14: 改进WIKI中技能归类的算法</li>
                    <li>2016-9-12: 修改部分老卡的CD, 感谢<x>真白的蓝白那啥</x>, <x>黑岩无敌</x>, <x>Core灬酷睿</x>和<x>yu1pbx</x>的帮助</li>
                    <li>2016-8-29: 修复20图里敌方射手座的全体沉默只施放一次的BUG, 感谢<x>咱家的小瓶子</x>的帮助</li>
                    <li>2016-8-28: <ul>
                        <li>添加20图到【地图战】</li>
                        <li>修复同调技能的数值BUG, 感谢<x>sens2017</x>的帮助</li>
                        <li>修复【真理导言】的数值BUG, 感谢<x>千下</x>的帮助</li>
                        <li>添加新卡【花族公主】, 感谢<x>会飞的霍比特人</x>的帮助</li>
                        <li>添加新卡【暗月守墓人】, 感谢<x>飞绒fly</x>的帮助</li>
                        <li>添加新卡【邪狱魔龙】, 感谢<x>会飞的霍比特人</x>的帮助</li>
                        <li>添加新卡【黑月魔女】, 感谢<x>逆骨魔方</x>的帮助</li>
                        <li>添加新卡【念力者】, 感谢<x>愤怒的小虾蛄</x>的帮助</li>
                        <li>添加新卡【孙悟空】, 感谢<x>会飞的霍比特人</x>的帮助</li>
                        <li>添加新卡【远古元素巨龙】</li>
                    </ul></li>
                    <li>2016-8-5: <ul>
                        <li>添加新卡<cf:c>铁马弓箭手</cf:c>, 感谢<x>lwq2928</x>的帮助</li>
                        <li>添加新卡<cf:c>最后的牧羊人</cf:c>, 感谢<x>会飞的霍比特人</x>的帮助</li>
                        <li>修复【灵魂消散】会对<cf:c>炎魔</cf:c>起效的BUG，感谢<x>torinouta0314</x>和<x>fesico</x>的帮助</li>
                    </ul></li>
                    <li>2016-7-21: 添加新卡<cf:c>钢铁蛮牛兽</cf:c>, 感谢<x>dl8o8lb</x>的帮助</li>
                    <li>2016-7-19: 添加新卡<cf:c>邪能控制者</cf:c>, 感谢<x>Core灬酷睿</x>的帮助</li>
                    <li>2016-7-16: 修复<cf:c>蝶语仙子</cf:c>的星数, 感谢<x>会飞的霍比特人</x>的帮助</li>
                    <li>2016-7-15: <ul>
                        <li>修改<cf:c>暗黑游侠</cf:c>的技能, 感谢<x>白朴1234</x>和<x>dl8o8lb</x>的帮助</li>
                        <li>添加网页版新卡<cf:c>禁忌之神</cf:c>, 感谢<x>lwq2928</x>的帮助</li>
                        <li>添加新卡<cf:c>霜狼酋长</cf:c>, 感谢<x>糖糖小彧</x>的帮助</li>
                    </ul></li>
                    <li>2016-7-11: <ul>
                        <li>添加网页版新卡<cf:c>月咏之镰</cf:c>, 感谢<x>1219302710</x>的帮助</li>
                        <li>添加新卡<cf:c>银河圣剑使</cf:c>, 感谢<x>真白的蓝白那啥</x>的帮助</li>
                        <li>添加新卡<cf:c>雷眼狂花</cf:c>, 感谢<x>爆爆团雪莱</x>的帮助</li>
                    </ul></li>
                    <li>2016-7-9: <ul>
                        <li>添加新卡<cf:c>暗黑游侠</cf:c>, 感谢<x>dl8o8lb</x>的帮助</li>
                        <li>添加网页版新卡<cf:c>智慧女神雅典娜</cf:c>, 感谢<x>lwq2928</x>的帮助</li>
                    </ul></li>
                    <li>2016-7-2: <ul>
                        <li>添加新符文<cf:c>磐石</cf:c>, 感谢<x>千下</x>的帮助</li>
                        <li>添加新卡<cf:c>联盟摄政王</cf:c>, 感谢<x>Core灬酷睿</x>和<x>》鬼鬼《</x>的帮助</li>
                        <li>添加网页版新卡<cf:c>凛冬邪歌</cf:c>, 感谢<x>xinkai_001</x>的帮助</li>
                        <li>WIKI: 增加【英雄数据】页面，可以查体力表，COST表之类信息</li>
                        <li>添加网页版新卡<cf:c>疯魔战神</cf:c>, 感谢<x>1219302710</x>和<x>苍真在天</x>的帮助</li>
                    </ul></li>
                    <li>2016-6-28: 添加网页版新卡<cf:c>浅灰的微笑</cf:c>, 感谢<x>游天使</x>的帮助</li>
                    <li>2016-6-25: <ul>
                        <li>添加新符文<cf:c>止水</cf:c>和<cf:c>封闭</cf:c>，效果都是我YY的，欢迎大家用动画战斗检测正确性，感谢<x>Core灬酷睿</x>的帮助</li>
                        <li>添加新卡<cf:c>圣堂刑律官</cf:c>，感谢<x>千下</x>的帮助</li>
                    </ul></li>
                    <li>2016-6-22: 添加新卡<cf:c>殉道者</cf:c>，感谢<x>白马殡天</x>的帮助</li>
                    <li>2016-6-21:<ul>
                        <li>添加新卡<cf:c>弱唤潮公主</cf:c>，这张卡15级只有2050HP，用于适应页游的情况</li>
                        <li>添加新卡<cf:c>钢铁士兵</cf:c></li>
                        <li>添加新卡<cf:c>火刃侍者</cf:c>, 感谢<x>白马殡天</x>的帮助</li>
                    </ul></li>
                    <li>2016-6-17: <ul>
                        <li>更新<cf:c>唤潮公主</cf:c>的数据，感谢<x>loyin0000</x>的帮助</li>
                        <li>添加网页版新卡【冰霜之心】，感谢<x>AJFASHGA</x>的帮助</li>
                    </ul></li>
                    <li>2016-6-16: 添加新卡<cf:c>唤潮公主</cf:c>, 感谢<x>qTMyの泪</x>和<x>loyin0000</x>的帮助</li>
                    <li>2016-6-15: <ul>
                        <li>添加新卡<cf:c>武形火焰尊者</cf:c>, 感谢<x>爆爆团雪莱</x>的帮助</li>
                        <li>添加网页版新卡【蝶语仙子】，感谢<x>传说中基巴传说</x>的帮助</li>
                    </ul></li>
                    <li>2016-6-12: 修复【反射装甲】和【恶灵汲取】在同一张卡上时会出现的动画BUG，感谢<x>裂空座2012</x>的帮助</li>
                    <li>2016-6-10: 现在部分老五星卡牌加上"WP"后缀可模拟器WP版CD，例如"金属巨龙WP"是WP版的4CD金属巨龙，感谢<x>希灵天使12345</x>提供的数据。</li>
                    <li>2016-6-5: <ul>
                        <li>修复【沉默】【不动】【反射装甲】三者互动时的BUG，感谢<x>爆爆团雪莱</x>和<x>不渝小溪</x>的帮助</li>
                        <li>添加网页版新卡【邪灵龙母】，感谢<x>jdppin</x>的帮助</li>
                    </ul></li>
                    <li>2016-5-31: 修复【全体沉默】和【免疫】作用时的BUG，感谢<x>砍掉重练</x>大大提交的代码。</li>
                    <li>2016-5-27: <ul>
                        <li>修复遗志技能发动时机的问题，感谢<x>咬起来喀嚓喀嚓</x>的帮助</li>
                        <li>添加新卡<cf:c>魂之乐师</cf:c></li>
                        <li>更新地图战19-3和19-10的敌方阵容，感谢<x>猪猪大联盟5</x>的提醒</li>
                        <li>给五张带有<cf:c>大毒汁之王</cf:c>或<cf:c>大毒汁怪</cf:c>的地图添加WP模式，感谢<x>0740201210</x>的提醒</li>
                        <li>添加网页版新卡【鲁纳斯歌者】，感谢<x>游天使</x>的帮助</li>
                    </ul></li>
                    <li>2016-5-22: <ul>
                        <li>修复一个【反射装甲】的BUG，感谢<x>cgq918</x>的帮助</li>
                        <li>添加19图, 感谢<x>Kica沫雪</x>的帮助</li>
                        <li>添加新卡<cf:c>武形斗圣</cf:c>, 感谢<x>仰落灬</x>的提醒</li>
                        <li>修改<cf:c>大毒汁之王</cf:c>和<cf:c>大毒汁怪</cf:c>的种族, 感谢<x>白朴1234</x>, <x>双刀月海</x>, <x>愤怒的小虾蛄</x>的提醒</li>
                    </ul></li>
                    <li>2016-5-14: <ul>
                        <li>添加新卡<cf:c>武形剑圣</cf:c>, 感谢<x>liuill</x>的提醒</li>
                        <li>修复【连锁攻击】和<cf:c>大毒汁之王</cf:c>作用时的一个BUG, 感谢<x>千下</x>和<x>dzx276941963</x>的帮助</li>
                        <li>修复【夺魂】会复活逃跑卡的BUG, 感谢<x>小死灵少女</x>的帮助</li>
                    </ul></li>
                    <li>2016-4-28: 修复【恶灵汲取】对魔王魔神时的一个BUG，感谢<x>happypower110</x>和<x>千下</x>的帮助</li>
                    <li>2016-4-23: 添加新卡<cf:c>星空战姬</cf:c></li>
                    <li>2016-4-21: 添加新卡<cf:c>鬼灵猎杀者</cf:c></li>
                    <li>2016-4-20: 添加新卡<cf:c>花语祈求者</cf:c></li>
                    <li>2016-4-18: 添加新卡<cf:c>烈焰蛇魔</cf:c>, 效果是我YY的:<ul>
                        <li>【恶灵汲取】的基数是敌方当前生命值，不是最大生命值</li>
                        <li>【恶灵汲取】无视免疫，但对魔王魔神无效</li>
                        <li>如果己方被对方物理攻击致死，则【恶灵汲取】无法发动</li>
                    </ul></li>
                    <li>2016-4-13: 添加新卡<cf:c>月之公主</cf:c>和<cf:c>海盗将军</cf:c>, 感谢<x>希灵天使12345</x>和<x>小死灵少女</x>提供的信息</li>
                    <li>2016-4-12: 增加英雄等级至130级, 感谢<x>砍掉重练</x>大神的更新</li>
                    <li>2016-4-9: 添加新卡<cf:c>纷争女神</cf:c>, 感谢<x>游天使</x>提供的资料</li>
                    <li>2016-4-5: 修复【凯撒之击】和【迷魂】相互作用时的BUG，感谢<x>捭阖黑利</x>发现BUG</li>
                    <li>2016-4-4: 添加新卡<cf:c>机械拳皇</cf:c>, <cf:c>智慧女神</cf:c>, <cf:c>花语术师</cf:c>, <cf:c>骸骨之王</cf:c>，效果都是我YY的，请大家实战测试。以下是YY细节：<ul>
                        <li>【圣母回声】就是超级回春术</li>
                        <li>【连击】面对英雄只能来一发</li>
                        <li>【连击】能触发两次【盾刺】</li>
                        <li>【连击】第一发打死卡后，不能继续发动第二发打英雄</li>
                        <li>【连击】每一发都能发动【穿刺】或【精准打击】</li>
                        <li>【先机】技能在符文发动后，所有卡牌行动前发动</li>
                    </ul></li>
                    <li>2016-3-30: 修复觉醒沉默对魔神魔王起效的BUG，感谢<x>cgq918</x>发现BUG</li>
                    <li>2016-3-8: <ul>
                        <li>添加新卡<cf:c>神风剑豪</cf:c>，【一闪】的技能效果是我YY的，细节如下，请大家实测检验：<ul>
                            <li>一闪不能减少自己受到的伤害，只能反弹一半伤害给对方</li>
                            <li>一闪对上脱困卡只能反弹伤害，不能晕眩</li>
                            <li>一闪对上免疫卡不仅能反弹伤害，也能晕眩</li>
                            <li>一闪的晕眩效果对魔王魔神无效，但反弹效果对魔王魔神有效</li>
                        </ul></li>
                        <li>添加新卡<cf:c>暗黑魔灵</cf:c></li>
                        <li>添加新卡<cf:c>不动明王</cf:c></li>
                    </ul></li>
                    <li>2016-3-4: 修复反击的一个BUG，感谢<x>希灵天使12345</x>指出问题</li>
                    <li>2016-3-2: 【WIKI】将“官方评级”更正为“碎片等级”，感谢<x>希灵天使12345</x>指出问题</li>
                    <li>2016-2-28: 修复骑士守护技能对上低血量卡牌时的BUG，感谢<x>爆爆团雪莱</x>的帮助</li>
                    <li>2016-2-26: <ul>
                        <li>修复一些极端情况下降临系技能的BUG，感谢<x>爆爆团雪莱</x>的帮助</li>
                        <li>修复传送非降临死契技能时的BUG，感谢<x>z_bian</x>的帮助</li>
                        <li>修复瘟疫和疾病致死的卡不发动死契技能的BUG，感谢<x>Mr懵</x>和<x>hanbly</x>的帮助</li>
                        <li>修复在攻击英雄时凯撒之击不发动的BUG，感谢<x>我不会用八神</x>的帮助</li>
                        <li>添加网页版新卡【黄金狮子】，感谢<x>我去页游大爷的</x>的帮助</li>
                        <li>添加新卡<cf:c>森林之主</cf:c>，感谢<x>希灵天使12345</x>的帮助</li>
                        <li>添加网页版新卡【全知灵龙】，感谢<x>xinkai_001</x>和<x>苍真在天</x>的帮助</li>
                        <li>修复沉默的发动顺序问题，感谢<x>dzx276941963</x>的帮助</li>
                    </ul></li>
                    <li>2016-2-25: <ul>
                        <li>更正<cf:c>双鱼座</cf:c>的技能, 感谢<x>飞不起来迦楼罗</x>的提醒</li>
                        <li>添加新卡<cf:c>夜魅鬼手</cf:c>, 感谢<x>希灵天使12345</x>的帮助</li>
                    </ul></li>
                    <li>2016-2-22: 添加新卡<cf:c>双鱼座</cf:c></li>
                    <li>2016-2-12: <ul>
                        <li>更新17-H-2的胜利条件，感谢<x>草拟駡的老巢</x>的提醒</li>
                        <li>添加网页版新卡【飞羽魔女】, 感谢<x>xinkai_001</x>提供的数据</li>
                    </ul></li>
                    <li>2016-2-8: 更新17图中某些场景的胜利条件，感谢<x>暴风飙车手</x>的提醒</li>
                    <li>2016-2-7: <ul>
                        <li>修复回魂和星云锁链以及降临系技能相关的BUG，感谢<x>爆爆团雪莱</x>的帮助</li>
                        <li>添加网页版新卡【弑神之刃】, 感谢<x>xinkai_001</x>提供的数据</li>
                    </ul></li>
                    <li>2016-2-6: 添加网页版新卡【暗黑九头龙】, 感谢<x>我去页游大爷的</x>提供的数据</li>
                    <li>2016-2-5: <ul>
                        <li>添加新卡<cf:c>圣枪弥撒</cf:c>, <cf:c>梦妖斩</cf:c>, <cf:c>真·预言之神</cf:c></li>
                        <li>添加新符文【狂战】, 【风暴】, 【鹰眼】</li>
                        <li>【地图战】添加对最新的18图万耀国的支持，感谢<x>catree1988</x>提供的数据</li>
                    </ul>
                    <li>2016-2-2: 在【莉莉丝战】中添加【网页版100级神秘盗贼】和【网页版100级精英盗贼】，感谢<x>白猪汪汪汪</x>提供的数据</li>
                    <li>2016-2-1: 添加新卡<cf:c>精灵王子</cf:c></li>
                    <li>2016-1-25: 添加新卡<cf:c>火焰巫女</cf:c>, <cf:c>占卜少女</cf:c>, <cf:c>元素精灵使</cf:c>, <cf:c>寒霜冰灵使</cf:c>, <cf:c>生化异形</cf:c>, 感谢<x>希灵天使12345</x>提供的资料</li>
                    <li>2016-1-21: 添加新卡<cf:c>水瓶座</cf:c></li>
                    <li>2016-1-12: 添加网页版新卡【烈焰狂战士】, 【远古吞食者】，感谢<x>无限之神X</x>提供的资料</li>
                    <li>2016-1-11: 添加新卡<cf:c>机甲魔神</cf:c>, 感谢<x>希灵天使12345</x>的提醒</li>
                    <li>2016-1-6: <ul>
                        <li>重新上架<cf:c>风暴海皇</cf:c></li>
                        <li>添加新卡<cf:c>预言之神</cf:c></li>
                    </ul></li>
                    <li>2015-1-2: 改版【魔神战】杂兵模式，现在一共4种模式：<ul>
                        <li>没有杂兵：顾名思义，没有任何杂兵，适合纯新区</li>
                        <li>普通杂兵：较弱的杂兵，五星极少，适合次新区</li>
                        <li>强力杂兵：较强的杂兵，4张以下五星，适合半新区</li>
                        <li>五星杂兵：清一色五星杂兵，不过没有续航怪，适合老区</li>
                    </ul></li>
                    <li>2015-12-30: 添加新卡<cf:c>天使猎人</cf:c>和<cf:c>摩羯座</cf:c></li>
                    <li>2015-12-27: 由于<cf:c>风暴海皇</cf:c>实测效果和原本YY的差太多，再加上木盒各种BUG，暂时下架</li>
                    <li>2015-12-22: 添加新卡<cf:c>不幸青鸟</cf:c>, <cf:c>红莲魔女</cf:c>和<cf:c>风暴海皇</cf:c>, 感谢<x>希灵天使12345</x>的帮助，【沉默】的效果是YY的，希望大家实测检验。</li>
                    <li>2015-12-18: 添加新卡<cf:c>创世神女</cf:c>和<cf:c>北海神兽</cf:c>, 感谢<x>moon_eyes</x>, <x>zx670122</x>, <x>MikuFanBunz</x>, <x>real11inter</x>和<x>raffinat</x>的帮助</li>
                    <li>2015-12-11: <ul>
                        <li>更新了WIKI里魔神和魔王的边框，感谢<x>逆水行舟1991</x>和<x>catree1988</x>提供的素材</li>
                        <li>修复了【燃烧】, 【烈火焚神】和【横扫】作用时的BUG</li>
                        <li>修复了【法力侵蚀】和【石林】作用时的BUG</li>
                    </ul></li>
                    <li>2015-12-08: 木盒偷偷改了【雷神降临】的数值, 模拟器也跟着更新了，现在这个技能更强大了</li>
                    <li>2015-12-07: 添加新卡<cf:c>制裁之锤</cf:c>, <cf:c>断罪之镰</cf:c>，感谢<x>希灵天使12345</x>提供数据。</li>
                    <li>2015-12-01: <ul>
                        <li>添加新卡<cf:c>潮汐王女</cf:c></li>
                        <li>慕和修了逃跑的BUG，模拟器也跟着改了</li>
                    </ul></li>
                    <li>2015-11-30: 添加新卡<cf:c>射手座</cf:c></li>
                    <li>2015-11-29: <ul>
                        <li><b>现在模拟器能识别卡牌的昵称和简称了，例如"黑丝","金属"</b></li>
                        <li>修复逃跑引发的各种问题，感谢<x>程love翔</x>报告BUG</li>
                        <li>修复组卡器中有重复卡牌的问题，感谢<x>程love翔</x>报告BUG</li>
                    </ul></li>
                    <li>2015-11-28: 添加网页版里独有的本源守护莉莉丝, 感谢<x>苍真在天</x>提供的数据</li>
                    <li>2015-11-26: <ul>
                        <li>修复新莉莉丝卡组里的一些bug，感谢<x>tyghgpp</x>, <x>传说中基巴传说</x>和<x>咬起来喀嚓喀嚓</x>报告BUG</li>
                        <li>恢复了旧版莉莉丝，感谢<x>dzx276941963</x>和<x>苍真在天</x>的建议</li>
                    </ul></li>
                    <li>2015-11-25: <ul>
                        <li>更新莉莉丝卡组</li>
                        <li>添加新卡<cf:c>福音乐师</cf:c>和<cf:c>幻想炼金士</cf:c></li>
                    </ul></li>
                    <li>2015-11-24: 添加新卡<cf:c>圣剑持有者</cf:c>和<cf:c>邪月翼魔</cf:c></li>
                    <li>2015-11-21: <ul>
                        <li>修复<cf:c>机械魔偶</cf:c>的15级数值问题，感谢<x>Never_枫纸</x>报告BUG</li>
                        <li>修复<cf:c>叹惋之歌</cf:c>洗【格挡】后伤害结算的问题，感谢<x>947053627</x>报告BUG</li>
                    </ul></li>
                    <li>2015-11-19: 修复【自动扣血】和【祈祷】相互作用时的问题，感谢<x>凉宫春日de倔强</x>, <x>ykkgoodboy</x>, <x>请问在8</x>报告BUG</li>
                    <li>2015-11-18： <ul>
                        <li>现在<cf:c>叹惋之歌</cf:c>能在英雄当前回合HP降的0的情况下拯救英雄了，感谢<x>dd3254690</x>报告BUG</li>
                        <li>添加新卡<cf:c>贪吃少女</cf:c></li>
                    </ul></li>
                    <li>2015-11-14: <ul>
                        <li>修复组卡器中【详情】按钮有时候通往不存在页面的BUG</li>
                        <li>去除组卡器中的素材卡，感谢<x>吹水不啰嗦</x>的建议</li>
                    </ul></li>
                    <li>2015-11-08: <ul>
                        <li>修复【骑士守护】计算残血法术伤害的一个问题，感谢<x>idleidol</x>报告BUG</li>
                        <li>修复最近更新自定义小兵后【莉莉丝战】统计数据显示的问题，感谢<x>单曲调调</x>报告BUG</li>
                    </ul></li>
                    <li>2015-11-07: 现在【莉莉丝战】可以自定义小兵了</li>
                    <li>2015-11-05: <ul>
                        <li>添加新卡<cf:c>骑士王血魂</cf:c>，感谢<x>idleidol</x>, <x>1000127900</x>提供情报</li>
                        <li>感谢<x>idleidol</x>实测确认<cf:c>天蝎座</cf:c>的技能</li>
                    </ul></li>
                    <li>2015-11-04: 修复【物理反弹】实现上的一个小问题，感谢<x>魔之座</x>报告BUG</li>
                    <li>2015-11-03: 更新网站主题，同时修复一些手机上黑屏或滚动条失灵的BUG，感谢<x>_R_Y_O_</x>的提醒</li>
                    <li>2015-11-02: 修复<cf:c>恶灵之剑</cf:c>技能数据的错误，感谢<x>dl8o8lb</x>报告BUG</li>
                    <li>2015-11-01: 添加新卡<cf:c>恶魔猎人</cf:c>，不过效果是我YY的</li>
                    <li>2015-10-28: 添加新卡<cf:c>天蝎座</cf:c>，不过效果是我YY的： <ul>
                        <li>普通攻击打上来被冰甲削减到110，所以只能反弹55伤害</li>
                        <li>弱点攻击打上来就能反弹攻击的一半伤害</li>
                        <li>横扫溅射、连锁攻击溅射也能反弹55伤害</li>
                        <li>斩杀因为破冰，所以也能反弹一半伤害</li>
                    </ul></li>
                    <li>2015-10-24: <ul>
                        <li>修复召唤物享受军团加成的BUG，感谢<x>ttmaster1</x>报告BUG</li>
                        <li>修复搜索卡牌无效的BUG，感谢<x>戒不了你IQ</x>报告BUG</li>
                    </ul></li>
                    <li>2015-10-21: 添加新卡<cf:c>叹惋之歌</cf:c>，感谢<x>catree1988</x>(一喵)和<x>1000127900</x>提供的资料。目前的实现是不能破冰甲</li>
                    <li>2015-10-18: <ul>
                        <li>添加【网页版复仇女神】，【网页版噩梦之主】，【网页版深渊魔影】，【网页版毁灭之神】，【网页版万蛛之后】，感谢<x>a27180411</x>提供的资料</li>
                        <li>修复<cf:c>无限之神</cf:c>用星云锁链召唤<cf:c>均衡女神</cf:c>时的BUG，感谢<x>小小艾魔卡</x>报告BUG</li>
                    </ul></li>
                    <li>2015-10-14: <ul>
                        <li>添加新卡<cf:c>晓之奏者</cf:c></li>
                        <li>添加【网页版邪龙之神】，感谢<x>a27180411</x>提供的资料</li>
                    </ul></li>
                    <li>2015-10-11:<ul>
                        <li>在【WIKI】中添加了【自定义卡图生成器】功能（手机版目前还看不到，只有电脑能用），只需提供自己喜欢的底图和设定，就能生成魔卡样式的卡图
                        <%--
                            <img src="<c:url value="/resources/img/help/customCardPortraitEntrance.png" />" style="width: 100%; max-width: 406px" />
                            <img src="<c:url value="/resources/img/help/customCardPortrait.png" />" style="width: 100%; max-width: 704px" />
                         --%>
                        </li>
                        <li>把魔王的图标换成了正确的图标，感谢<x>虚梦杀</x>提供信息</li>
                    </ul></li>
                    <li>2015-10-06: <ul>
                        <li>【WIKI】将素材卡单独抽取为一类，感谢<x>虚梦杀</x>的建议</li>
                        <li>【WIKI】修复某些关卡信息不正确的BUG，感谢<x>dzx276941963</x>报告BUG</li>
                        <li>【WIKI】中的卡牌现在有图了
                        <%--
                            <img class="help-img" alt="示例卡牌图片1" src="<c:url value="/resources/img/help/SampleCardPortrait1.png" />" />
                            <img class="help-img" alt="示例卡牌图片1" src="<c:url value="/resources/img/help/SampleCardPortrait2.png" />" />
                        --%>
                        </li>
                    </ul></li>
                    <li>2015-10-05: 【WIKI】中添加了符文和关卡信息</li>
                    <li>2015-10-02: 升级【卡牌WIKI】为【魔卡幻想WIKI】，现在可以搜索技能了</li>
                    <li>2015-10-01: 在【魔神战】界面添加显示魔神的技能</li>
                    <li>2015-09-29: 添加新卡<cf:c>天秤座</cf:c>、<cf:c>龙灵使者</cf:c>、<cf:c>森林弹唱者</cf:c>、<cf:c>灵峰剑姬</cf:c></li>
                    <li>2015-09-27: 修复一个【斩杀】和【冰甲】相互作用时的BUG，感谢<x>k221135</x>报告BUG</li>
                    <li>2015-09-26: <ul>
                        <li>为【莉莉丝战】添加【活动卡牌】的支持，感谢<x>咬起来喀嚓喀嚓</x>和<x>泥鳅sined</x>提供信息</li>
                        <li>补上<cf:c>炎魔</cf:c>、<cf:c>投掷巨人</cf:c>、<cf:c>鬼符咒术师</cf:c>、<cf:c>恐怖失血者</cf:c>和<cf:c>复仇铠甲</cf:c>的卡图，感谢<x>御洛念</x>和<x>咬起来喀嚓喀嚓</x>提供的卡图</li>
                        <li>加强了【WIKI】的功能和外观，现在魔王、魔神可以正确地显示，也能通过技能来搜索卡牌了，感谢<x>虚梦杀</x>的建议</li>
                    </ul></li>
                    <li>2015-09-24: 添加新卡<cf:c>黄金毒龙</cf:c>、<cf:c>永夜真祖</cf:c>、<cf:c>水母精灵</cf:c>、<cf:c>王国厨师长</cf:c>、<cf:c>鬼符咒术师</cf:c>、<cf:c>丰饶之神</cf:c></li>
                    <li>2015-09-10: <ul>
                        <li>对【魔神战】的结果显示方法进行一些微调，感谢<x>主公摇头怕怕</x>的建议</li>
                        <li>添加新卡<cf:c>月樱公主</cf:c>，感谢<x>咬起来喀嚓喀嚓</x>的提醒</li>
                        <li>修复【地图战】计算种族类胜利条件时的一个BUG，感谢<x>零崎燎识</x>发现BUG</li>
                    </ul></li>
                    <li>2015-09-09: <ul>
                        <li>修复【不屈】会引发【自爆】的BUG，感谢<x>邪眼真王二代目</x>发现BUG</li>
                        <li>修复【不屈】在我方回合被触发时的处理机制，感谢<x>pk810219899</x>发现BUG</li>
                    </ul></li>
                    <li>2015-09-08: 改进【魔神战】的结果显示，现在除了基本信息外，还会有伤害分布图
                        <%--<img class='help-img' alt="伤害分布图" src='<c:url value="/resources/img/help/DamageDistributionChart.png" />' /> --%>
                    </li>
                    <li>2015-09-06: 修复一个【送还】、【不动】、【魔神之刃】相互作用时候的BUG，感谢<x>dzx276941963</x>发现BUG</li>
                    <li>2015-09-03: <ul>
                        <li>添加新卡<cf:c>处女座</cf:c>，感谢<x>戒不了你IQ</x>的提醒</li>
                        <li>添加新卡<cf:c>僵尸新娘</cf:c>，感谢<x>MikuFanBunz</x>的提醒</li>
                        <li>添加新卡<cf:c>山羊人前锋</cf:c>，感谢<x>珊0殇 </x>的提醒</li>
                    </ul></li>
                    <li>2015-08-29: <ul>
                        <li>添加新卡<cf:c>鬼灵搜索师</cf:c>，感谢<x>咬起来喀嚓喀嚓</x>的提醒</li>
                        <li>添加新卡<cf:c>不屈之灵</cf:c></li>
                    </ul></li>
                    <li>2015-08-27: 添加新卡<cf:c>雪月花</cf:c></li>
                    <li>2015-08-15: <ul>
                        <li>添加【保存录像】和【播放录像】供能
                        <%--
                        <img class='help-img' alt="保存录像" src='<c:url value="/resources/img/help/showSaveVideoDataPanel.jpg" />' />
                        <img class='help-img' alt="复制录像数据" src='<c:url value="/resources/img/help/copyVideoData.jpg" />' /><br />
                        <span>然后将录像数据保存到随便什么地方，或者分享到贴吧</span><br />
                        <span>要观看录像的小伙伴可以把录像数据直接复制进【播放录像】的界面里观看</span><br />
                        --%>
                        </li>
                        <li>修复一个魔神战COST显示的BUG，感谢<x>wanghwx2014</x>报告BUG</li>
                    </ul></li>
                    <li>2015-08-14: 添加新卡<cf:c>残翼羽神</cf:c>、<cf:c>无限之神</cf:c>、<cf:c>银河观测者</cf:c>，感谢<x>咬起来喀嚓喀嚓</x>和<x>heixuanfeng54</x>的提醒</li>
                    <li>2015-08-04: <ul>
                        <li>更新魔神，增加【强魔刃复仇女神】、【强魔咒邪龙之神】、【强魔甲噩梦之主】、【强魔咒毁灭之神】、【强魔甲深渊影魔】、【强魔刃万蛛之后】来对应最新强化过的魔神，感谢<x>We_Yukirin</x>, <x>鲁鲁修司</x>提供情报</li>
                        <li>更新【战争怒吼】在对方场上有10张卡以上时的行为，和游戏一致，感谢<x>mrmrrain</x>提供情报</li>
                    </ul></li>
                    <li>2015-08-02: <ul>
                        <li>修复一个【转生】的BUG，感谢<x>中国移动坑爹6</x>, <x>WS零度冰点 </x>报告BUG</li>
                        <li>添加新卡<cf:c>精灵投掷者</cf:c>、<cf:c>精灵重甲弓手</cf:c>、<cf:c>失魂哥布林</cf:c>，感谢<x>虚梦杀</x>提供资料</li>
                    </ul></li>
                    <li>2015-08-01: <ul>
                        <li>修复一个【不屈】和治疗技能的BUG，感谢<x>薛定谔只喵</x>, <x>real11inter</x>报告BUG</li>
                        <li>现在【地图战】界面内可以看到该图的敌方阵容了，感谢<x>dl8o8lb</x>的提议</li>
                        <li>添加新卡<cf:c>迅捷豹女</cf:c></li>
                        <li>添加新卡<cf:c>狮子座</cf:c></li>
                    </ul></li>
                    <li>2015-07-28: <ul>
                        <li>修复<cf:c>大毒汁之王</cf:c>和<cf:c>谎言之神</cf:c>的技能BUG，感谢<x>saxitong</x>, <x>l793366568</x>, <x>平平一指</x>, <x>仰落灬</x>, <x>裂空座2012</x>报告BUG</li>
                        <li>修复【魔力印记】相关的技能BUG，感谢<x>裂空座2012</x>报告BUG</li>
                        <li>修改【守护】技能在英雄残血时候的计算方法，和慕和的行为一致，感谢<x>l793366568</x>提供的信息</li>
                    </ul>
                    <li>2015-07-26: <ul>
                        <li>添加新技能【精神狂乱】，感谢<x>l793366568</x>, <x>Mr懵</x>, <x>qazqwe240</x>, <x>凉宫春日de倔强</x>, <x>黯影羽</x>的帮助</li>
                        <li>添加17图所有关卡，感谢<x>qhd252623</x>, <x>l793366568</x>提供的丰富资料</li>
                        <li>添加新卡<cf:c>荆棘妖姬</cf:c>、<cf:c>恶魔傀儡</cf:c>、<cf:c>魔导骑兵</cf:c>、<cf:c>复仇铠甲</cf:c>，感谢<x>We_Yukirin</x>的提醒</li>
                        <li>添加新卡<cf:c>吞噬守卫者</cf:c>，感谢<x>虚梦杀</x>的提醒</li>
                        <li>修复莉莉丝战不检查卡组的BUG，感谢<x>wswc2</x>发现BUG</li>
                        <li>修复一个【奋战】的计算BUG，感谢<x>brunoweiyang</x>发现BUG</li>
                    </ul></li>
                    <li>2015-07-25: <ul>
                        <li>添加新卡<cf:c>大毒汁之王</cf:c>，感谢<x>l793366568</x>提供资料</li>
                        <li>添加新卡<cf:c>魔装机神</cf:c>，感谢<x>仰落灬</x>提供资料</li>
                        <li>添加新卡<cf:c>希望之壳</cf:c>，感谢<x>We_Yukirin</x>提供资料</li>
                    </ul></li>
                    <li>2015-07-17: 添加新卡<cf:c>九命猫神</cf:c>，感谢<x>艾弗森张伯伦</x>提供资料</li>
                    <li>2015-07-11: <ul>
                        <li>添加新卡<cf:c>七彩之影</cf:c>、<cf:c>巨蟹座</cf:c>，感謝<x>竞彩小菜鸟</x>, <x>華麗麗摔倒</x>, <x>0蝶舞九天0</x>的提醒</li>
                        <li>修复【破魔手】技能的伤害BUG，感谢<x>裂空座2012</x>发现</li>
                        <li><cf:c>血祭恶魔</cf:c>、<cf:c>血炼巫妖</cf:c>、<cf:c>血瞳魔剑师</cf:c>、<cf:c>血色骑士</cf:c>四张卡的旧卡名称现在也可以使用了，感谢<x>akb48zwy</x>的建议</li>
                    </ul></li>
                    <li>2015-06-20: <ul>
                        <li>添加新卡<cf:c>命运占卜师</cf:c></li>
                        <li>为魔神战添加了【随机强杂兵】模式，此模式中魔神的杂兵实力将明显增强，用来配合最近的魔神更新。</li>
                        <li>为了响应焚化部的号召，部分卡牌改名:<ul>
                            <li>血祭恶魔 -> 恶魔伯爵</li>
                            <li>血炼巫妖 -> 巫妖学徒</li>
                            <li>血瞳魔剑师 -> 赤瞳魔剑师</li>
                            <li>血色骑士 -> 暗色骑士</li>
                        </ul></li>
                    </ul></li>
                    <li>2015-06-13: <ul>
                        <li>添加新卡<cf:c>狡诈邪神</cf:c>，感谢<x>dl8o8lb</x>, <x>希埃尔之遗物</x></li>
                        <li>修改魔神名，不再用[新]、[旧]前缀，而用魔神具有代表性技能作前缀，比如<cf:c>送还复仇女神</cf:c>。感谢<x>wolfeopen</x>, <x>ggmmhaha</x>, <x>eudfhgtdr</x></li>
                    </ul></li>
                    <li>2015-06-07: <ul>
                        <li>添加新卡<cf:c>彼岸使者</cf:c>，感谢<x>real11inter</x>, <x>傲娇王孙</x>, <x>957065547</x>的提供情报</li>
                    </ul></li>
                    <li>2015-06-05: <ul>
                        <li>添加新卡<cf:c>双子座</cf:c></li>
                        <li>添加新卡<cf:c>机械魔偶</cf:c>，感谢<x>青的魔法使</x></li>
                    </ul></li>
                    <li>2015-05-23: <ul>
                        <li>添加新技能【闪光弹】、【致盲】，感谢<x>947053627</x>, <x>曾经的雪寂</x>, <x>裘可拉kiss</x>, <x>raffinat</x>, <x>灼眼阿卡林</x>, <x>司徒不想</x>, <x>唯一心3</x>, <x>为何打后</x>的帮助
                        <li>添加新卡<cf:c>堕落修女</cf:c>、<cf:c>金牛座</cf:c></li>
                    </ul></li>
                    <li>2015-05-21: 添加新卡<cf:c>百花女神</cf:c>、<cf:c>深渊吞噬者</cf:c>、<cf:c>野猪人卫士</cf:c></li>
                    <li>2015-05-20: 添加新卡<cf:c>恐怖失血者</cf:c>，感謝<x>lrxlrx207</x></li>
                    <li>2015-05-17: 添加新技能【燕返】，添加新卡<cf:c>欲望惩罚者</cf:c>、<cf:c>月镰杀手</cf:c>，感谢<x>real11inter</x>, <x>bendlueng99</x>, <x>千下</x>, <x>jiye30</x>的帮助</li>
                    <li>2015-05-10: <ul>
                        <li>添加新卡<cf:c>羽蛇神</cf:c>、<cf:c>屠龙勇士</cf:c></li>
                        <li>现在竞技场战的胜利条件可以用文字自由设定了，点击[<a href="#help" target="_blank">查看胜利条件的写法</a>]</li>
                        <li>为了方便配卡，现在可以使用【符文+0】的表达法了</li>
                        <li>现在如果玩家COST、卡槽、符文槽不符合规则，错误会显示在战斗结果里，但战斗模拟仍然继续</li>
                        <li>十分感谢<x>akb48zwy</x>, <x>real11inter</x>的建议和协助</li>
                    </ul></li>
                    <li>2015-05-09: <ul>
                        <li>取消COST和卡槽数量限制，方便地下城的模拟</li>
                        <li>现在可以在竞技场战里设置胜利条件了
                        <%--
                            <img class='help-img' alt="胜利条件1" src='<c:url value="/resources/img/help/VictoryCondition1.png" />' />
                            <img class='help-img' alt="胜利条件2" src='<c:url value="/resources/img/help/VictoryCondition2.png" />' />
                        --%>
                        </li>
                    </ul></li>
                    <li>2015-04-25: <ul>
                        <li>添加新卡<cf:c>投掷巨人</cf:c>，感谢<x>晶蓝矢秩</x>提醒</li>
                        <li>添加新卡<cf:c>白羊座</cf:c>，感谢<x>不小心到了这里</x>, <x>联邦兽王</x>, <x>lg5zh</x>, <x>hatachaing</x>, <x>毓飞扬</x>, <x>li87684765</x>, <x>real11inter</x>的帮助</li>
                    </ul></li>
                    <li>2015-03-28: 添加新卡<cf:c>元素之灵</cf:c>，关于同调技能尚不完善，欢迎大家踊跃回答问题补充技能细节。感谢<x>不渝小溪</x>, <x>老子衿</x>, <x>brunoweiyang</x>, <x>裘可拉kiss</x>的帮助</li>
                    <li>2015-03-26: 添加新卡<cf:c>精灵王亡灵</cf:c></li>
                    <li>2015-03-21: 添加【WIKI】页面，现在可以直接在站内查询卡牌数据资料了</li>
                    <li>2015-03-15: <ul>
                        <li>修复COST计算上的一些问题，感谢<x>十二下弦月</x>, <x>sincever123</x>, <x>习题盖浇饭</x>, <x>za7183</x>, <x>NobodyHere_</x></li>
                        <li>修复【旧噩梦之主】的攻击力问题，感谢<x>dzx276941963</x></li>
                        <li>修复地图战中计算卡牌星数胜利条件时把召唤物也算入的BUG，感谢<x>赵泽杭0</x></li>
                    </ul></li>
                    <li>2015-02-27：<ul>
                        <li>添加新卡<cf:c>战场舞姬</cf:c></li>
                        <li>修复一个<cf:c>复活节兔女郎</cf:c>的BUG, 感谢<x>傲娇王孙</x>报告BUG</li>
                    </ul></li>
                    <li>2015-02-15: <ul>
                        <li>添加新卡：<cf:c>炎魔</cf:c>、<cf:c>战意斗神</cf:c>、<cf:c>大毒汁怪</cf:c></li>
                        <li>添加16图的地图战模拟</li>
                        <li>为了方便优化卡组，现在可以使用<b>凤凰*0</b>这样的表示法了</li>
                    </ul></li>
                    <li>2015-02-14: <ul>
                        <li>添加新卡：<cf:c>爱神</cf:c>、<cf:c>圣泉之灵</cf:c></li>
                        <li>修复【献祭】和【复活】作用是的一个BUG，感谢<x>My_陌艾</x>报告BUG</li>
                    </ul></li>
                    <li>2015-02-13: <ul>
                        <li>修复旧魔神吃各种技能的BUG，感谢<x>孤光斩月</x>报告BUG</li>
                        <li>修复召唤物会享受基础加成的BUG，感谢<x>悪丿娘殿下</x>报告BUG</li>
                        <li>添加新卡：<cf:c>战场扫荡者</cf:c>、<cf:c>魔幻人偶师</cf:c></li>
                    </ul></li>
                    <li>2015-01-31: 旧魔神改成第一版的魔神，以便和美服马服对应</li>
                    <li>2015-01-30: 修复一个【鲜血盛宴】极端情况下的BUG</li>
                    <li>2015-01-23: <ul>
                        <li>修复<cf:c>圣堂执政官</cf:c>的数据BUG，感谢<x>血色☆星辰</x>报告BUG</li>
                        <li>添加<cf:c>邪魔屠夫</cf:c>卡图，感谢<x>susss222</x>提供数据</li>
                        <li>修正【森林沐浴】技能结算方法，感谢<x>小歆时代</x>提供的大量实测数据</li>
                    </ul></li>
                    <li>2015-01-21: <ul>
                        <li>修复数据BUG - <cf:c>圆月魔女</cf:c>3技能由【净化】改成【神性祈求】，感谢<x>susss222</x>报告BUG</li>
                        <li>添加<cf:c>巨石投石车手</cf:c>的卡图</li>
                        <li>修复【献祭】不发动死契技能的BUG，感谢<x>千下</x>报告BUG</li>
                    </ul></li>
                    <li>2015-01-20: <ul>
                        <li>修复【大地之盾】的BUG，感谢<x>catree1988</x>, <x>qazqwe240</x>报告BUG</li>
                        <li>添加<cf:c>咒怨稻草人</cf:c>的卡图，感谢<x>qazqwe240</x>提供图片</li>
                        <li>添加新卡<cf:c>赤面天狗</cf:c></li>
                    </ul></li>
                    <li>2015-01-17: <ul>
                        <li>新增莉莉丝活动卡<cf:c>半人鱼恶魔</cf:c>、<cf:c>圣灵大祭司</cf:c>、<cf:c>圣城卫士</cf:c>、<cf:c>咒怨稻草人</cf:c>、<cf:c>邪魔屠夫</cf:c>、<cf:c>巨石投石车手</cf:c>，感谢<x>绯弹亚丝娜</x>, <x>yezhihuib</x>, <x>程love翔</x>, <x>susss222</x>提供数据</li>
                        <li>恢复了旧魔神的模拟，方便马服美服用户</li>
                        <li>添加新卡：<cf:c>世界杯·美国</cf:c>、<cf:c>世界杯·法国</cf:c>、<cf:c>世界杯·德国</cf:c>、<cf:c>世界杯·韩日</cf:c>、<cf:c>世界杯·南非</cf:c>、<cf:c>世界杯·巴西</cf:c>，感谢<x>程love翔</x>提供数据</li>
                        <li>修复【不屈】和【狙击】【治疗】【吸血】作用时的BUG，感谢<x>King_Goldencat</x>, <x>piaoyizhiying</x>, <x>壹滴海洋</x>, <x>流光映梦</x>提供信息</li>
                    </ul></li>
                    <li>2015-01-16: 修复【回魂】的BUG，感谢<x>誓死支持双剑</x>, <x>欲印弥彰</x>, <x>唔滴哟</x>, <x>逆骨魔方</x>, <x>文文ww0327</x>, <x>下一片海enjoy</x>, <x>悠零幽灵</x>报告BUG</li>
                    <li>2015-01-15: <ul>
                        <li>修复一个【送还】的BUG</li>
                        <li>修复莉莉丝平均攻击伤害的计算BUG，感谢<x>仙桃大神</x>报告BUG</li>
                    </ul></li>
                    <li>2015-01-14: <ul>
                        <li>修复【轻灵】的BUG，感谢<x>魔之座</x>报告BUG</li>
                        <li>修复<cf:c>亡灵守护神</cf:c>数据BUG，感谢<x>悪丿娘殿下</x>报告BUG</li>
                    </ul></li>
                    <li>2015-01-13: 修复莉莉丝英雄血量的BUG，感谢<x>office12345</x>, <x>wufan0908</x>, <x>shit水水更健康</x>, <x>enjoy小小康</x>报告BUG</li>
                    <li>2015-01-12: <ul>
                        <li>现在【竞技场战】可以调整全局卡牌和英雄强度了</li>
                        <li>修复【莉莉丝战】无法使用组卡器的BUG，感谢<x>欺一世时光_</x>, <x>哈哈哈雷宇桑</x>报告BUG</li>
                    </ul></li>
                    <li>2015-01-11: <ul>
                        <li>添加13-15地图，感谢<x>一喵</x>提供大量模拟器直接可用的信息</li>
                        <li>修复一个关于锁定状态下邪灵汲取的BUG，感谢<x>壹滴海洋</x>发现BUG</li>
                        <li>修正降临系技能的发动顺序，感谢<x>快到碗里来mys</x>, <x>程love翔</x>, <x>原追忆</x>, <x>susss222</x>, <x>恶梦之猫</x>, <x>UlysessDH</x>, <x>血月之下为战鬼</x>提供信息</li>
                    </ul></li>
                    <li>2015-01-10: 添加新模式【莉莉丝战】，感谢<x>yezhihuib</x>大神的资料和无私奉献，感谢<x>小猫崽k</x>, <x>快到碗里来mys</x>, <x>阿呆Frank</x>, <x>阿里兰朵</x>, <x>adssgd</x>的热心帮助。
                    <li>2015-01-09: 添加新卡<cf:c>驭灵法师</cf:c>，感谢<x>均卡</x>提供数据</li>
                    <li>2015-01-08: <ul>
                        <li>添加新卡<cf:c>圣泉元神</cf:c></li>
                        <li>对魔神战杂兵进行修正，感谢<x>程love翔</x>, <x>AIYIfancy</x>, <x>哈哈哈雷宇桑</x>, <x>三头龙巫妖</x>, <x>wennington</x>, <x>原追忆</x>提供信息</li>
                        <li>BUG修复：修正一个【死亡印记】的BUG，感谢<x>susss222</x>报告BUG</li>
                    </ul></li>
                    <li>2015-01-07: 为【魔神战】添加【随机杂兵】模式，感谢<x>徽飞湮咩</x>, <x>zx16792007</x>提供信息</li>
                    <li>2015-01-06: 添加新卡<cf:c>黄金金属巨龙</cf:c>，感谢<x>雪拾玖</x>提供数据</li>
                    <li>2015-01-04: <ul>
                        <li>添加新卡<cf:c>均衡女神</cf:c>，感谢<x>1243712047</x>, <x>快到碗里来mys</x>提供信息</li>
                        <li>添加新技能【死亡印记】，感谢<x>susss222</x>提供信息</li>
                        <li>添加新卡<cf:c>灵俑暗杀者</cf:c>、<cf:c>鬣蜥人密探</cf:c>、<cf:c>贪婪之心</cf:c></li>
                    </ul></li>
                    <li>2015-01-03: <ul>
                        <li>添加新卡<cf:c>铁血剑豪</cf:c>、<cf:c>铸造大师</cf:c>、<cf:c>巨龙剑士</cf:c>、<cf:c>重装半鹿人</cf:c>、<cf:c>太古魔狼</cf:c></li>
                        <li>添加技能【不屈】，感谢<x>aquoo66</x>, <x>NoMoCol</x>, <x>程love翔</x>, <x>平平一指</x>, <x>我是菜鸟430</x>, <x>快到碗里来mys</x>提供信息</li>
                        <li>修复【鬼步】激活条件的BUG，感谢<x>出发1985</x>报告BUG</li>
                        <li>修复【龙吟】会造成null错误的BUG，感谢<x>cxqlyt</x>报告BUG</li>
                        <li>修复【降临-全体阻碍】技能未发动的BUG，感谢<x>出发1985</x>报告BUG</li>
                        <li>修复<cf:c>峦龙</cf:c>的种族错误，感谢<x>出发1985</x>报告BUG</li>
                        <li>添加符文【神祈】，感谢<x>出发1985</x>提供信息</li>
                    </ul></li>
                    <li>2015-01-02: <ul>
                        <li>修复<cf:c>陨星魔法使</cf:c>召唤时候会null错误的BUG，感谢<x>为何打后</x>报告BUG</li>
                        <li>修复召唤物死亡时秽土会尝试转生的BUG，感谢<x>susss222</x>报告BUG</li>
                        <li>添加符文【玄石】、【龙吟】，感谢<x>麋鹿吉特</x>, <x>susss222</x>提供信息</li>
                    </ul></li>
                    <li>2015-01-01: <ul>
                        <li>添加新卡<cf:c>湿地黏龙</cf:c>蛮荒四星</li>
                        <li>添加新卡<cf:c>怒雪咆哮</cf:c>蛮荒五星，感谢<x>麋鹿吉特</x>提供数据。</li>
                        <li>添加新技能【大地之盾】，感谢<x>雪拾玖</x>, <x>zx16792007</x>, <x>快到碗里来mys</x>, <x>为何打后</x>, <x>暗之影5</x>提供信息</li>
                        <li>完成【复仇女神】魔神、【万蛛之后】魔神，感谢<x>麋鹿吉特</x>提供数据。</li>
                        <li>添加新卡<cf:c>血色骑士</cf:c>王国四星、<cf:c>无尽噩梦</cf:c>地狱五星</li>
                    </ul></li>
                    <li>2014-12-31: 添加各级【莉莉丝】、<cf:c>星夜女神</cf:c>森林五星，完成【噩梦之主】魔神</li>
                    <li>2014-12-30: 添加<cf:c>陨星魔法师</cf:c>王国五星、<cf:c>梦境耳语者</cf:c>森林四星、<cf:c>乌鸦人长老</cf:c>蛮荒四星、<cf:c>谎言之神</cf:c>地狱五星、<cf:c>瓦尔基里英灵</cf:c>王国四星</li>
                    <li>2014-12-28: 添加<cf:c>骨灵巫女</cf:c>地狱五星、<cf:c>月蚀兽</cf:c>地狱五星</li>
                    <li>2014-12-27: 添加<cf:c>逐月饿狼</cf:c>地狱五星、<cf:c>蝗虫公爵</cf:c>地狱五星、<cf:c>镜魔</cf:c>地狱四星、<cf:c>蝠王恶灵</cf:c>地狱四星</li>
                    <li>2014-12-26: 添加<cf:c>死域军神</cf:c>地狱五星、<cf:c>圆月魔女</cf:c>地狱五星、<cf:c>魅灵吞噬者</cf:c>地狱四星、<cf:c>峦龙</cf:c>地狱五星</li>
                    <li>2014-12-25: 添加<cf:c>暗影牧师</cf:c>地狱四星、<cf:c>地狱炎车手</cf:c>地狱四星、<cf:c>炼狱玩具熊</cf:c>地狱四星、<cf:c>血妖舞女</cf:c>地狱四星</li>
                    <li>2014-12-24: 添加<cf:c>逐日凶狼</cf:c>蛮荒五星、<cf:c>刃羽钢隼</cf:c>蛮荒四星、<cf:c>摩羯大祭司</cf:c>蛮荒五星、<cf:c>荒野巫医</cf:c>蛮荒四星</li>
                    <li>2014-12-23: 添加<cf:c>兽灵使者</cf:c>蛮荒四星、<cf:c>盾墙巨兽</cf:c>蛮荒四星、<cf:c>狂野雷电</cf:c>蛮荒四星、<cf:c>野猪人萨满</cf:c>蛮荒四星</li>
                    <li>2014-12-22: 添加<cf:c>浅海水兽</cf:c>蛮荒四星、<cf:c>蛮族酋长</cf:c>蛮荒四星、<cf:c>神谕火狐</cf:c>蛮荒五星、<cf:c>山羊人先锋</cf:c>蛮荒四星</li>
                    <li>2014-12-21: 添加<cf:c>幸运星贤者</cf:c>森林四星、<cf:c>破晓守卫</cf:c>森林五星、<cf:c>洞察之鹰</cf:c>森林四星、<cf:c>人马大贤者</cf:c>森林四星</li>
                    <li>2014-12-20: 添加<cf:c>浮云青鸟</cf:c>森林五星、<cf:c>尖啸曼陀罗</cf:c>森林四星、<cf:c>雷雕之魂</cf:c>森林五星、<cf:c>星辰之蝶</cf:c>森林四星</li>
                    <li>2014-12-19: 添加<cf:c>圣炎魔导师</cf:c>王国五星、<cf:c>红月女仆</cf:c>王国三星、<cf:c>飞行器机师</cf:c>王国四星、<cf:c>琴舞之风</cf:c>森林四星</li>
                    <li>2014-12-18: 添加<cf:c>幻术舞姬</cf:c>王国四星、<cf:c>钢铁巨神兵</cf:c>王国五星、<cf:c>鬼斩破</cf:c>王国四星、<cf:c>星辰主宰</cf:c>王国五星</li>
                    <li>2014-12-17: 添加<cf:c>死兆星</cf:c>地狱五星、<cf:c>东方幻术师</cf:c>王国四星、<cf:c>大图书馆长</cf:c>王国四星、<cf:c>重甲冲锋兵</cf:c>王国四星</li>
                    <li>2014-02-06: 添加<cf:c>浴火龙女</cf:c>王国五星</li>
                    <li>2014-01-24: 添加【熊老师】（同时也会加入到人品测试）<ul>
                        <li>种族：萌货，星数：五星，速度：4，10级COST：0，15级COST：0</li>
                        <li>10级二维：AT=800, HP=2000</li>
                        <li>15级二维：AT=1000, HP=2250</li>
                        <li>技能1：[降临]关小黑屋1 - 随机送还对手场上一张卡片，关入小黑屋，可被免疫、不动抵抗。</li>
                        <li>技能2: 吐槽2 - 随机吐槽对手场上两张卡片，导致其精神崩溃，对自己造成当前攻击力的伤害，可被免疫、脱困抵抗。</li>
                        <li>技能3: 被插出五星1 - 被物理攻击命中并承受伤害时，30%几率随机召唤卡堆中的一张五星卡片上场，可发动降临技。</li>
                        </ul>
                    </li>
                    <li>2014-01-23: 在动画中给魔神加上了卡图，魔神现在终于有脸了。</li>
                    <li>2014-01-18: 添加符文 - 【鬼步】（群体脱困），场上地狱大于2张发动，感谢<b>高端大气上档次</b>提供情报。</li>
                    <li>2014-01-15:<ul>
                        <li>新卡加入 - <cf:c>海军水手</cf:c>王国三星</li>
                        <li>数据修复 - <cf:c>世界树之灵</cf:c>10级COST修正为16。多谢<b>长天渔歌</b>提供情报。</li>
                        <li>数据修复 - <cf:c>恐惧之王</cf:c>15级COST修正为17。多谢<b>高端大气上档次</b>提供情报。</li>
                        </ul>
                    </li>
                    <li>2014-01-12: 新功能 - 增加【人品测试房】。
                    <li>2014-01-11: 数据修复 - <cf:c>世界树之灵</cf:c>15级COST修正为17。多谢<b>里根</b>和<b>乌鸦</b>提供情报。</li>
                    <li>2014-01-10:<ul>
                        <li>BUG修复 - 修正交流区的留言时间的时区问题，统一改到北京时间。</li>
                        <li>BUG修复 - 现在【横扫】遇上【邪灵汲取】后，后续的攻击按照削弱后的攻击力算。感谢<b>乌鸦</b>提供情报。</li>
                        </ul>
                    </li>
                    <li>2014-01-07:<ul>
                        <li>BUG修复 - 现在回合数正确地从1开始，而不是之前的0，感谢<b>jjkkt</b>提供情报。</li>
                        <li>BUG修复 - 现在被死契技能控制（冰冻、麻痹、锁定、迷惑）的卡牌会在正确的时机解除控制，感谢<b>jjkkt</b>提供情报。</li>
                        <li>BUG修复 - 现在【吸血】能正确地在死契技能发动前发动，感谢<b>a0026881</b>提供情报。</li>
                        </ul>
                    </li>
                    <li>2014-01-06: 魔神战【卡组强度分析】添加【总体平均每分钟伤害】指标，方便大家计算卡组的平均强度。</li>
                    <li>2014-01-05:<ul>
                        <li>BUG修复 - 被控制并且被【迷魂】的卡片现在会打自己英雄了。用吧友<b>w13210886303</b>的话说就是“被绳子绑着被虐待着还要自己用头撞墙！”感谢<b>地花出吠喊</b>提供情报。</li>
                        <li>BUG修复 - 被【复活】上来处于【复活】状态的卡牌现在不享受符文效果，感谢<b>LLOO</b>、<b>a0026881</b>等朋友提供情报。</li>
                        <li>BUG修复 - 现在<cf:c>九头妖蛇</cf:c>在被<cf:c>复活节兔女郎</cf:c>复活后能正确的献祭<cf:c>复活节兔女郎</cf:c>，感谢<b>老头是废柴</b>等朋友提供情报。</li>
                        <li>优化 - 魔神战的文字战斗现在会在首行显示对魔神造成的伤害，不必再翻页查看。</li>
                        </ul>
                    </li>
                    <li>2014-01-04: 添加新卡<cf:c>海军司令</cf:c>王国五星，感谢<b>我就是那么叼</b>和<b>寒风</b>提供情报，感谢<b>上行之风</b>发现BUG。</li>
                    <li>2013-12-30: 添加新卡<cf:c>天界守护者</cf:c>王国五星，感谢<b>轩</b>和<b>UII</b>提供情报。</li>
                    <li>2013-12-25: 更新5张新卡，感谢<b>a272295516</b>等朋友热情提供情报。
                        <ul><li>森林：<cf:c>蒲公英仙子</cf:c></li><li>蛮荒：<cf:c>荒漠仙人掌</cf:c> <cf:c>熊人巫医</cf:c> <cf:c>半狮人武士</cf:c> <cf:c>齐天美猴王</cf:c></li></ul>
                    </li>
                    <li>2013-12-10: 修复【透支】之后没有立即死亡被【回春】救活的BUG，感谢<b>IP为118.*.*.129</b>的朋友提供情报</li>
                    <li>2013-12-09: 应大家的需求，魔神战添加更多统计值（最大、最小、平均伤害，不稳定度）</li>
                    <li>2013-12-08: 修复【脱困】无法防止【迷魂】的BUG，感谢<b>a0026881</b>提供情报</li>
                    <li>2013-12-07: BUG修复
                        <ul>
                            <li>修复【背刺】技能的一个BUG，感谢<b>IP为222.*.*.174</b>的朋友提供情报</li>
                            <li>感谢大家的回复，<cf:c>毁灭之龙</cf:c>的HP已修正</li>
                            <li>修复一个【趁胜追击】和【复仇】攻击英雄时候的BUG，感谢<b>DdiTp</b>提供情报</li>
                        </ul>
                    </li>
                    <li>2013-12-06: 更新导航界面</li>
                    <li>2013-12-04: 添加旧魔神的模拟
                        <ul>
                            <li>应广大WP玩家的强烈要求，在魔神战中复了添加了旧魔神的模拟</li>
                            <li>修复一个封印技能某些时候会导致错误的BUG</li>
                            <li>感谢<b>福哥马林</b>积极提出各种建议</li>
                        </ul>
                    </li>
                    <li>2013-12-03: 魔神更新以及BUG修复
                        <ul>
                            <li>六大魔神技能全面升级，感谢<b>cwal18</b>提供情报</li>
                            <li>修复<cf:c>虚空假面</cf:c>的攻击力BUG，感谢<b>slbtsbc</b>和<b>守望月磐</b>提供情报</li>
                            <li>修复<cf:c>魔法协会长</cf:c>复活带【封印】或【背刺】卡牌时候的BUG，感谢<b>a0026881</b>提供情报</li>
                        </ul>
                    </li>
                    <li>2013-11-30: BUG修复
                        <ul>
                            <li>修复【横扫】触发额外【裂伤】的BUG，感谢<b>沸腾的冰红茶</b>提供情报</li>
                            <li>修复<cf:c>世界树之灵</cf:c>【神圣守护】的BUG，感谢<b>hejiangting8</b>提供情报</li>
                            <li>修复<cf:c>世界树之灵</cf:c>COST的BUG，感谢<b>IP为221.*.*.158的朋友</b>提供情报</li>
                            <li>更新<cf:c>骸骨大将</cf:c>的第二技能为【[死契]暴风雪6】，感谢<b>IP为112.*.*.134的朋友</b>提供情报</li>
                        </ul>
                    </li>
                    <li>2013-11-28: 全面修复17张新卡的COST
                        <ul>
                            <li>感谢魔卡WIKI的及时更新和各位朋友的提醒</li>
                        </ul>
                    </li>
                    <li>2013-11-27: 修复几个BUG
                        <ul>
                            <li><cf:c>精灵女王</cf:c>的COST从19改为17，15级COST改为19（感谢吧友<b>uiiysss1</b>提供情报）</li>
                            <li>修复地图战中<b>无符文</b>的条件判断错误（感谢吧友<b>勿忘干将</b>和<b>ycphoenix</b>提供情报）</li>
                            <li>修复<cf:c>魔法协会长</cf:c>总是复活最后死亡的卡的BUG（感谢吧友<b>PandaGM</b>提供情报）</li>
                            <li>新加的一些卡片的数据都来源于魔卡WIKI，但是这次WIKI上的COST数值都很诡异，多数卡10级和15级的COST没有区别，可能有错，希望大家一起帮忙排查</li>
                        </ul>
                    </li>
                    <li>2013-11-25: 添加17张新卡
                        <ul>
                            <li>王国：<cf:c>血瞳魔剑师</cf:c> <cf:c>王城巡逻犬</cf:c> <cf:c>魔能巨石像</cf:c> <cf:c>科学怪人</cf:c> <cf:c>驯鹰射手</cf:c></li>
                            <li>森林：<cf:c>复仇血精灵</cf:c> <cf:c>裁决巨石像</cf:c> <cf:c>高等暗精灵</cf:c> <cf:c>梦境女神</cf:c> <cf:c>精灵女王</cf:c></li>
                            <li>蛮荒：<cf:c>仙狐巫女</cf:c> <cf:c>尖牙捕食者</cf:c> <cf:c>冰雪巨人</cf:c> <cf:c>龙角将军</cf:c></li>
                            <li>地狱：<cf:c>赤红地狱战马</cf:c> <cf:c>骸骨大将</cf:c> <cf:c>末日预言师</cf:c></li>
                        </ul>
                    </li>
                </ul>
            </div>
        </div>
    </div>